myJLKE/system/grad
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2206
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the gradient of a field.

\*---------------------------------------------------------------------------*/

type            grad;
libs            (fieldFunctionObjects);

field           p;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
